#+TITLE: DataTables

DataTables is a JavaScript library for tables that has [[file:/srv/ecm/app/www/DataTables.org::*\[\[https://datatables.net/manual/server-side\]\[Server-side processing\]\]][Server-side
processing]].


#+PROPERTY: header-args:sql :engine postgres :cmdline "\"host=db.ecm.lan port=5432 user=maxclaims dbname=maxclaims\""
NOPE#+PROPERTY: header-args:sql :engine postgres :cmdline "\"host=maxbakuntu.lan port=5432 user=maxclaims dbname=maxclaims\""

#+begin_src sql

  CREATE OR REPLACE FUNCTION DataTables_row_to_json_array(record)
  RETURNS JSON LANGUAGE PLPGSQL IMMUTABLE AS $$
  DECLARE
   res json;
  BEGIN
    SELECT json_agg((jr).value) INTO res
       FROM (SELECT (json_each(row_to_json($1))) jr) jk
     WHERE (jr).key != 'DataTables recordsTotal' AND (jr).key != 'DataTables recordsFiltered' ;
    return res;
  END;
  $$;
  CREATE OR REPLACE FUNCTION DataTables_cols_to_json_array(record)
  RETURNS JSON LANGUAGE PLPGSQL IMMUTABLE AS $$
  DECLARE
   res json;
  BEGIN
    SELECT json_agg((jr).key) INTO res
       FROM (SELECT (json_each(row_to_json($1))) jr) jk
     WHERE (jr).key != 'DataTables recordsTotal' AND (jr).key != 'DataTables recordsFiltered' ;
    return res;
  END;
  $$;

  CREATE OR REPLACE FUNCTION DataTables_row_to_json_object(record)
  RETURNS JSON LANGUAGE PLPGSQL IMMUTABLE AS $$
  DECLARE
   res json;
  BEGIN
    SELECT json_object_agg((jr).key, (jr).value) INTO res
       FROM (SELECT (json_each(row_to_json($1))) jr) jk
     WHERE (jr).key != 'DataTables recordsTotal' AND (jr).key != 'DataTables recordsFiltered' ;
    return res;
  END;
  $$;

  CREATE OR REPLACE FUNCTION DataTables_order_by(params json)
  RETURNS TEXT LANGUAGE SQL IMMUTABLE AS $$
  SELECT array_to_string(array_agg(concat(od->>'name', ' ', od->>'dir')), ', ')
    FROM (SELECT json_array_elements($1->'order') AS od) dto;
  $$;  


  --- CREATE TABLE IF NOT EXISTS __DT_TEST ( params JSON ) ;
  	 
  CREATE OR REPLACE FUNCTION DataTables_query
    (_SELECT TEXT, _FROM_WHERE TEXT, params JSON)
  RETURNS JSON LANGUAGE PLPGSQL AS $$
  DECLARE
   q TEXT;
   _tbl TEXT;
   _data JSON;
   _cols JSON;
   _limit int := 10;
   _offset int := 0;
   _recordsTotal int := 0;
   _recordsFiltered int := 0;
   _rowType text := 'array';
   _order_by text;
  BEGIN

  --- INSERT into __DT_TEST(params) VALUES ($3);

  _order_by = DataTables_order_by($3);

  IF (_order_by IS NOT NULL AND _order_by != '')
   THEN _order_by = ' ORDER BY ' || _order_by; END IF;

  q := concat('SELECT *, count(*) OVER() AS "DataTables recordsFiltered"
    FROM (', $1, ', COUNT(*) OVER() AS "DataTables recordsTotal"',
    $2, ') ___DT___ ', _order_by, ' LIMIT($1) OFFSET($2)');
  _tbl := gen_random_uuid()::text;

  IF ($3->>'start' IS NOT NULL) THEN _offset := $3->>'start'; END IF;
  IF ($3->>'length' IS NOT NULL) THEN _limit := $3->>'length'; END IF;
  IF ($3->>'rowType' IS NOT NULL) THEN _rowType := $3->>'rowType'; END IF;

  -- EXECUTE concat('DROP TABLE IF EXISTS "',_tbl,'"');
  EXECUTE concat('CREATE TEMP TABLE "',_tbl,
     '" ON COMMIT DROP AS (', q, ');')
     USING _limit, _offset;

  EXECUTE concat('SELECT "DataTables recordsTotal" FROM "', _tbl, '" __dt__ LIMIT 1')
   INTO _recordsTotal;

  EXECUTE concat('SELECT "DataTables recordsFiltered" FROM "', _tbl, '" __dt__ LIMIT 1')
   INTO _recordsFiltered;

  IF (_rowType ILIKE 'object') THEN
    EXECUTE concat('SELECT json_agg(DataTables_row_to_json_object((__dt__))) FROM "', _tbl, '" __dt__')
    INTO _data;
  ELSE 
    EXECUTE concat('SELECT json_agg(DataTables_row_to_json_array((__dt__))) FROM "', _tbl, '" __dt__')
    INTO _data;
  END IF;

  EXECUTE concat('SELECT DataTables_cols_to_json_array((__dt__)) FROM "', _tbl, '" __dt__ LIMIT 1')
    INTO _cols;

  RETURN json_build_object(
  'draw', $3->'draw',
  'recordsTotal', _recordsTotal,
  'recordsFiltered', _recordsFiltered,
  'columns', _cols,
  'data', _data);
  END; $$;


    

#+end_src

#+RESULTS:
| CREATE FUNCTION |
|-----------------|
| CREATE FUNCTION |
| CREATE FUNCTION |
| CREATE FUNCTION |
| CREATE FUNCTION |


#+begin_src sql
  SELECT DataTables_query('
   SELECT *','FROM diary_view_mat', '{}');
#+end_src
#+RESULTS:
| datatables_query                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| {"recordsTotal" : 2646, "recordsFiltered" : 2646, "columns" : ["diary_id", "claim_id", "user_id", "note", "open", "date", "user_name", "contract_id", "contract_number", "policy_id", "policy_number", "insured_id", "insured_name", "risk_id", "risk_type", "risk", "contract", "policy", "insured", "claim"], "data" : [[15134, 12513, 1, "Claim is still Open", false, "2013-10-24", "Crampsie", 1418, "PI069122(42)", 7908, "T60033", 10272, "Atlantic Canada Textile Manufacturing Ltd.", 7373, "Commercial", {"risk_id":7373,"risk_type_name":"Commercial","policy_id":7908,"contract_id":1418,"risk_code":null,"risk_number":null}, {"contract_id":1418,"contract_number":"PI069122(42)","agency_id":1005,"insurance_company_id":1007,"effective_date":"2006-10-05","expiry_date":"2007-10-04","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":7908,"agent_id":1005,"insured_id":10272,"effective_date":"2006-03-12T00:00:00","expiry_date":"2007-03-12T00:00:00","policy_number":"T60033","deductible":null,"company_id":1007,"underwriter_id":21443,"branch_id":13563,"agency_office_id":null}, {"person_id":10272,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Atlantic Canada Textile Manufacturing Ltd.","address1":"18 Talisman Cres. / 330 Main St ","address2":null,"city":"Fredricton / Chipman","province_state_id":9,"postal_zip_code":null,"home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":null,"birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":null,"user_password":null,"postal_code":"E3C 1L9 / E0E 1C0","middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"CA","province":"NB","full_name":"Atlantic Canada Textile Manufacturing Ltd.","short_name":"Atlantic Canada Textile Manufacturing Ltd.","full_name_ts":"'038634':2 '038635':1 '354380':5 '463000':4 '563000':3 '667439':7 '667539':6 '830000':8","address":"18 Talisman Cres. / 330 Main St , Fredricton / Chipman, NB, E3C 1L9 / E0E 1C0, CA"}, {"claim_id":12513,"adjuster_id":16399,"date_of_loss":"2006-11-14T00:00:00","status":"Closed","cause":null,"modified":null,"rev_date":null,"open_date":"2006-11-15T00:00:00","close_date":"2014-01-03T08:02:07.388245","plaintiff_id":null,"notes":null,"risk_id":7373,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16004, 4265, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1222, "S0124594", 3450, "S01254594", 4369, "Jock Gilbert Group", 2378, "Commercial", {"risk_id":2378,"risk_type_name":"Commercial","policy_id":3450,"contract_id":1222,"risk_code":null,"risk_number":null}, {"contract_id":1222,"contract_number":"S0124594","agency_id":4269,"insurance_company_id":1007,"effective_date":"2001-05-01","expiry_date":"2002-04-30","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3450,"agent_id":4269,"insured_id":4369,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S01254594","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4369,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Jock Gilbert Group","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"Jock Gilbert Group","short_name":"Jock Gilbert Group","full_name_ts":"'145000':2 '150000':1 '445000':4 '450000':3 '587930':5 '597000':6","address":", NSW, AU"}, {"claim_id":4265,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2378,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16022, 4281, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1223, "S000985", 3466, "S000985", 4385, "Stockdale & Leggo - Ocean Grove", 2394, "Commercial", {"risk_id":2394,"risk_type_name":"Commercial","policy_id":3466,"contract_id":1223,"risk_code":null,"risk_number":null}, {"contract_id":1223,"contract_number":"S000985","agency_id":4269,"insurance_company_id":1007,"effective_date":"2000-08-01","expiry_date":"2001-07-31","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3466,"agent_id":4269,"insured_id":4385,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S000985","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4385,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Stockdale & Leggo - Ocean Grove","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"Stockdale & Leggo - Ocean Grove","short_name":"Stockdale & Leggo - Ocean Grove","full_name_ts":"'046000':5 '056000':4 '245380':2 '253800':1 '597000':6 '850000':3","address":", NSW, AU"}, {"claim_id":4281,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2394,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16036, 4262, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1222, "S0124594", 3447, "S01254594", 4366, "DTZ Australia", 2376, "Commercial", {"risk_id":2376,"risk_type_name":"Commercial","policy_id":3447,"contract_id":1222,"risk_code":null,"risk_number":null}, {"contract_id":1222,"contract_number":"S0124594","agency_id":4269,"insurance_company_id":1007,"effective_date":"2001-05-01","expiry_date":"2002-04-30","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3447,"agent_id":4269,"insured_id":4366,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S01254594","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4366,"parent_person_id":null,"first_name":"","last_name":"","company_name":"DTZ Australia","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"DTZ Australia","short_name":"DTZ Australia","full_name_ts":"'043980':2 '340000':1","address":", NSW, AU"}, {"claim_id":4262,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2376,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16045, 4304, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1223, "S000985", 3489, "S000985", 4513, "Barwood Parker", 2614, "Commercial", {"risk_id":2614,"risk_type_name":"Commercial","policy_id":3489,"contract_id":1223,"risk_code":null,"risk_number":null}, {"contract_id":1223,"contract_number":"S000985","agency_id":4269,"insurance_company_id":1007,"effective_date":"2000-08-01","expiry_date":"2001-07-31","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3489,"agent_id":4269,"insured_id":4513,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S000985","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4513,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Barwood Parker","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"Barwood Parker","short_name":"Barwood Parker","full_name_ts":"'795900':2 '797300':1","address":", NSW, AU"}, {"claim_id":4304,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2614,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16052, 4311, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1223, "S000985", 3496, "S000985", 4451, "Drake & Associates", 2621, "Commercial", {"risk_id":2621,"risk_type_name":"Commercial","policy_id":3496,"contract_id":1223,"risk_code":null,"risk_number":null}, {"contract_id":1223,"contract_number":"S000985","agency_id":4269,"insurance_company_id":1007,"effective_date":"2000-08-01","expiry_date":"2001-07-31","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3496,"agent_id":4269,"insured_id":4451,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S000985","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4451,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Drake & Associates","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"Drake & Associates","short_name":"Drake & Associates","full_name_ts":"'044340':3 '045340':2 '395000':1","address":", NSW, AU"}, {"claim_id":4311,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2621,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16096, 4358, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1226, "S900684", 3543, "S900684", 4462, "Landisle Pty Ltd (DPW Realty)", 2668, "Commercial", {"risk_id":2668,"risk_type_name":"Commercial","policy_id":3543,"contract_id":1226,"risk_code":null,"risk_number":null}, {"contract_id":1226,"contract_number":"S900684","agency_id":4269,"insurance_company_id":3484,"effective_date":"1999-12-01","expiry_date":"2000-11-30","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3543,"agent_id":4269,"insured_id":4462,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S900684","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4462,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Landisle Pty Ltd (DPW Realty)","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"Landisle Pty Ltd (DPW Realty)","short_name":"Landisle Pty Ltd (DPW Realty)","full_name_ts":"'370000':4 '730000':2 '830000':3 '863480':1 '983000':5","address":", NSW, AU"}, {"claim_id":4358,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2668,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16120, 4387, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1226, "S900684", 3572, "S900684", 4491, "Hamey Lucas #2", 2697, "Commercial", {"risk_id":2697,"risk_type_name":"Commercial","policy_id":3572,"contract_id":1226,"risk_code":null,"risk_number":null}, {"contract_id":1226,"contract_number":"S900684","agency_id":4269,"insurance_company_id":3484,"effective_date":"1999-12-01","expiry_date":"2000-11-30","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3572,"agent_id":4269,"insured_id":4491,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S900684","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4491,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Hamey Lucas #2","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"Hamey Lucas #2","short_name":"Hamey Lucas #2","full_name_ts":"'560000':1 '844000':3 '854000':2","address":", NSW, AU"}, {"claim_id":4387,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2697,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16135, 4406, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1225, "S800318", 3591, "S800318", 4510, "Nationwide Penrith", 2716, "Commercial", {"risk_id":2716,"risk_type_name":"Commercial","policy_id":3591,"contract_id":1225,"risk_code":null,"risk_number":null}, {"contract_id":1225,"contract_number":"S800318","agency_id":4269,"insurance_company_id":3484,"effective_date":"1999-12-01","expiry_date":"2000-11-30","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3591,"agent_id":4269,"insured_id":4510,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S800318","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4510,"parent_person_id":null,"first_name":"","last_name":"","company_name":"Nationwide Penrith","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"Nationwide Penrith","short_name":"Nationwide Penrith","full_name_ts":"'636730':1 '769300':2","address":", NSW, AU"}, {"claim_id":4406,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2716,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}], [16140, 4411, 1, "Claim is still Open and Examinar does not have a user", false, "2013-10-24", "Crampsie", 1225, "S800318", 3596, "S800318", 4515, "East Coast Geotechnical", 2721, "Commercial", {"risk_id":2721,"risk_type_name":"Commercial","policy_id":3596,"contract_id":1225,"risk_code":null,"risk_number":null}, {"contract_id":1225,"contract_number":"S800318","agency_id":4269,"insurance_company_id":3484,"effective_date":"1999-12-01","expiry_date":"2000-11-30","syndicate_id":null,"london_broker_id":null,"syndicate_number":null,"year_of_account":null}, {"policy_id":3596,"agent_id":4269,"insured_id":4515,"effective_date":"2001-04-01T00:00:00","expiry_date":"2002-04-01T00:00:00","policy_number":"S800318","deductible":null,"company_id":3484,"underwriter_id":null,"branch_id":null,"agency_office_id":null}, {"person_id":4515,"parent_person_id":null,"first_name":"","last_name":"","company_name":"East Coast Geotechnical","address1":"","address2":"","city":"","province_state_id":101,"postal_zip_code":"","home_phone":"","work_phone":"","fax_phone":"","cell_phone":"","email_address":"","birth_date":null,"date_added":null,"date_modified":null,"company_flag":null,"user_id":"","user_password":"","postal_code":null,"middle_name":null,"title":null,"suffix":null,"address_id":null,"country":"AU","province":"NSW","full_name":"East Coast Geotechnical","short_name":"East Coast Geotechnical","full_name_ts":"'043000':1 '443000':3 '534648':7 '534658':6 '535648':5 '535658':4 '543000':2","address":", NSW, AU"}, {"claim_id":4411,"adjuster_id":19,"date_of_loss":"2002-04-02T00:00:00","status":"Closed","cause":"No code selected","modified":0,"rev_date":null,"open_date":"2002-04-07T00:00:00","close_date":"2014-06-25T12:48:45.948203","plaintiff_id":null,"notes":null,"risk_id":2721,"adjuster_office_id":null,"deductible":0.00,"defense_counsel_id":null,"coverage_counsel_id":null,"total_deductible":0.00,"authority":0.00,"external_adjuster_id":null,"recovery_subrogation_date":null,"claim_received_time":null,"claim_acknowledged_time":null,"peer_reviewed_date":null,"line_of_business":null,"coverage":null,"event_category":null,"basis_of_settlement":null,"subscription_percent":null,"denial":false,"refer_to_underwriters":false,"over_authority":null,"open_for_recovery":false,"claim_first_notification_acknowledgement_date":null,"insured_contacted_time":null,"first_site_visit_time":null,"restoration_firm_id":null,"restoration_firm_emergency_id":null,"restoration_firm_repair_id":null,"lineage":null,"date_of_denial":null,"reason_for_denial":null,"date_claim_made":null,"group_leader_id":null,"label":null,"complaint":null}]]} |

* Sent parameters

When making a request to the server using server-side processing,
DataTables will send the following data in order to let the server
know what data is required:

| Parameter name              | Type                                                   | Description                                                                                                                                                                                                                                                                                                                                            |
|-----------------------------+--------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
  - =draw=                     [[//datatables.net/reference/type/integer][=integer=]]  :: Draw counter. This is
    used by DataTables to ensure that the Ajax returns from
    server-side processing requests are drawn in sequence by
    DataTables (Ajax requests are asynchronous and thus can return out
    of sequence). This is used as part of the =draw= return parameter
    (see below).  |
    
  - =start=                    [[//datatables.net/reference/type/integer][=integer=]]  :: Paging first record
    indicator. This is the start point in the current data set (0
    index based - i.e. 0 is the first record).  |
    
  - =length=                   [[//datatables.net/reference/type/integer][=integer=]]  :: Number of records that
    the table can display in the current draw. It is expected that the
    number of records returned will be equal to this number, unless
    the server has fewer records to return. Note that this can be -1
    to indicate that all records should be returned (although that
    negates any benefits of server-side processing!)  |
    
  - =search[value]=            [[//datatables.net/reference/type/string][=string=]]    :: Global search value. To
    be applied to all columns which have =searchable= as =true=.  |
    
  - =search[regex]=            [[//datatables.net/reference/type/boolean][=boolean=]]  :: =true= if the global
    filter should be treated as a regular expression for advanced
    searching, =false= otherwise. Note that normally server-side
    processing scripts will not perform regular expression searching
    for performance reasons on large data sets, but it is technically
    possible and at the discretion of your script.  |
    
  - =order[i][column]=         [[//datatables.net/reference/type/integer][=integer=]]  :: Column to which ordering
    should be applied. This is an index reference to the =columns=
    array of information that is also submitted to the server.  |
    
  - =order[i][dir]=            [[//datatables.net/reference/type/string][=string=]]   :: Ordering direction for
    this column. It will be =asc= or =desc= to indicate ascending
    ordering or descending ordering, respectively.  |
    
  - =columns[i][data]=         [[//datatables.net/reference/type/string][=string=]]   :: Column's data source, as
    defined by [[//datatables.net/reference/option/columns.data][=columns.data=]].  |
    
  - =columns[i][name]=         [[//datatables.net/reference/type/string][=string=]]   :: Column's name, as defined
    by [[//datatables.net/reference/option/columns.name][=columns.name=]].  |
    
  - =columns[i][searchable]=   [[//datatables.net/reference/type/boolean][=boolean=]]  :: Flag to indicate if this
    column is searchable ( =true=) or not ( =false=). This is
    controlled by [[//datatables.net/reference/option/columns.searchable][=columns.searchable=]].  |
    
  - =columns[i][orderable]=    [[//datatables.net/reference/type/boolean][=boolean=]]  :: Flag to indicate if this
    column is orderable ( =true=) or not ( =false=). This is
    controlled by [[//datatables.net/reference/option/columns.orderable][=columns.orderable=]].  |
    
  - =columns[i][search][value] [[//datatables.net/reference/type/string][=string=]]   :: Search value to apply to
    this specific column.  |
    
  - =columns[i][search][regex] [[//datatables.net/reference/type/boolean][=boolean=]]  :: Flag
    to indicate if the search term for this column should be treated
    as regular expression ( =true=) or not ( =false=). As with global
    search, normally server-side processing scripts will not perform
    regular expression searching for performance reasons on large data
    sets, but it is technically possible and at the discretion of your
    script. 
    

The =order[i]= and =columns[i]= parameters that are sent to the server are arrays of information:

- =order[i]= - is an array defining how many columns are being ordered upon - i.e. if the array length is 1, then a single column sort is being performed, otherwise a multi-column sort is being performed.
- =columns[i]= - an array defining all columns in the table.

In both cases, =i= is an integer which will change to indicate the array value. In most modern server-side scripting environments this data will automatically be available to you as an array.
